#Задание 1
import json
score = {"Key1":[123,541],"key2":[4124,616]}
file = "jsonfile.json"
with open(file ,"w", encoding="utf-8") as jsonfile:
    jsonfile.write(json.dumps(score, ensure_ascii=False))


#Задание 2
import csv
dow = [
    ["Название товара","Дата","№  магазина","Сумма продаж","Продавец"],
    ["Стол","1 сен","№ 1","$23450","Иванов"],
    ["стул","1 фев","№ 2","$17200","Петров"],
    ["Кровать двухместная","12 дек","№ 2","$0","Петров"],
    ["Кресло кровать","25 мар","№ 2","$1210"    ,"Иванов"],
    ["Кресло мягкое","10 мар","№ 1","$0","Сидоров"],
    ["Диван книга","25 апр","№ 1","$13420","Сидоров"],
    ["Кровать односпальная","28 фев","№ 3","$1278","Семенов"],
    ["Стол","5 янв","№ 3","$1260","Семенов"],
    ["Кровать двухместная","17 мар","№ 3","$130","Семенов"],
    ["Кресло мягкое","4 апр","№ 1","$23780","Семенов"],
    ["Кресло мягкое","24 мар","№ 1","$120","Иванов"],
    ["Диван книга","30 янв","№ 2","$10500","Петров"],
    ["Стол","21 апр","№ 2","$870","Иванов"],
    ["Стул","17 мар","№ 3","$750","Сидоров"],
    ["Стол","18 мар","№ 3","$5156","Петров"]
]
with open("Tabke.csv","w",encoding="utf-8") as newtable:
    newwrite=csv.writer(newtable)
    for i in dow:
        newwrite.writerow(i)
with open("Tabke.csv","r",encoding="utf-8") as file:
    print(file.read())
